[{"data":1,"prerenderedAt":54},["Reactive",2],{"search-api":3},[4,11,23,31,39,47],{"id":5,"path":6,"dir":7,"title":8,"description":7,"keywords":9,"body":10},"content:0.index.md","/","","Home",[],"     \nExploreX —   \nExplore. Beyond Bounds.   An initiative by   PIXL Studios .     Rich, Easy to understand and Well Documented User Interface.   50+ Pages  documented and increasing.  Custom Made Media such as Images and Slideshows.  Use of Simple Grammar to ensure clarity of concepts.  Highly Capable Search System   (Search ⌘K)         Why Choose Us?      Innovative Learning Experience   Explorex offers an innovative and immersive learning experience tailored for modern classrooms. With interactive 3D models, engaging quizzes, and seamless application access, students can grasp complex concepts effortlessly.    Enhanced Educator Support   Explorex empowers teachers with comprehensive tools to manage classrooms effectively. You can conduct quizzes, use X-Write to work efficiently and show interactive 3D Models to facilitate the process of learning effectively.    Effortless Application Access   Say goodbye to the hassle of navigating between various applications. Explorex simplifies the process with quick access, allowing both teachers and students to focus on learning rather than tech complexities.    Seamless Integration with School Curriculum   Explorex seamlessly integrates with existing school curricula, making it a valuable addition to any classroom. Our app aligns with educational standards, allowing educators to effortlessly incorporate it into their teaching plans.    Constant Innovation and Updates   We are committed to continuous improvement. Explorex regularly updates its features, ensuring that both teachers and students have access to the latest educational tools and technologies. Your learning experience with Explorex will always be cutting-edge.    Well Documented User Interface   We've made sure to document the working of not only apps in the   PIXL Suite , but also many other apps such as File Manager, WPS Office, Microsoft Teams and Many More!",{"id":12,"path":13,"dir":14,"title":15,"description":16,"keywords":17,"body":22},"content:1.introduction:1.getting-started.md","/introduction/getting-started","introduction","Getting Started with ExploreX","Welcome to ExploreX, the innovative educational application that is reshaping the way we learn and teach. This comprehensive guide will walk you through the features and functionalities of ExploreX, ensuring a smooth and engaging experience in your educational journey. The best part? ExploreX is completely free to use, with no registration or login required!",[18,19,20,21],"What is ExploreX?","Key Features:","Installation and Setup","Conclusion","  Getting Started with ExploreX  Welcome to ExploreX, the innovative educational application that is reshaping the way we learn and teach. This comprehensive guide will walk you through the features and functionalities of ExploreX, ensuring a smooth and engaging experience in your educational journey. The best part? ExploreX is completely free to use, with no registration or login required!  What is ExploreX?  ExploreX is a user-friendly educational tool designed to enhance the classroom experience for both educators and students. Its intuitive interface and powerful features simplify the teaching process, making learning more interactive and enjoyable.  Key Features:  1. Quick Access to Applications:  Easily navigate through, install, or just update through a variety of applications with just a few clicks. ExploreX simplifies the process, ensuring that you spend more time teaching and less time managing technology.  2. Built-in Browser:  Seamlessly integrate online resources into your lessons using the built-in browser. Say goodbye to switching between complex tabs stattered everywhere; everything you need is right at your fingertips!  3. 3D Model Interaction:  Bring complex concepts to life with new levels of simplicity using our 3D Models Library! You can zoom, pan across, and explore through a plethora of 3D models—whether you're looking for something complex like the Anatomy of the Human Eye, or something simple like a Book, it's all right here, just in a couple clicks, all in a completely safe environment.*  Installation and Setup  Download and Install ExploreX  Using the button below you can download and install ExploreX, or you could also visit our official   website  to do so—and the best part? No Registration or Login required, and everything is completely free!\n  \n...and that's all you have to do! All of the setting up is automatically completed in the background, while the user is taken through an onboarding experience to familiarise themselves with the app.  Homepage Overview  Upon launching ExploreX, you'll find yourself on the homepage. Take a moment to observe the neatly organized chips on the top, ensuring quick and easy navigation, along with the time and weather above. You can find other advanced tools if you scroll down, but more on that later. This intuitive design ensures that you can swiftly identify and access the applications you need for your lessons.  Navigating Applications  Click on any application to see it's context page, where you can open or update the app to it's latest version. Explore its features, test its functionality, and get accustomed to its interface. Familiarize yourself with the layout, menus, and available options. Most applications within ExploreX have simplified interfaces, making it easy for educators to use them effectively.  Using the Built-in Browser  To access the built-in browser, click on the dedicated browser chip on the homepage. Enter the URL of an educational website or search for specific topics of interest. Navigate through the web content just like you would on any standard browser. Take note of the seamless transition between applications and web pages, enabling you to enrich your lessons with a vast array of online resources.  Interacting with 3D Models  Access the 3D model tool to explore the extensive library of interactive models. Click on a model to open it. Use touch gestures to rotate, zoom, and manipulate the model. Appreciate the intricate details and educational value these models bring to your lessons. Consider how you can incorporate them into your teaching to enhance students' understanding of complex subjects.  Conclusion  By delving into the detailed exploration of ExploreX’s user interface, you equip yourself with the knowledge and confidence needed to create immersive and interactive lessons. Whether you are an educator aiming to transform your classroom or a student eager to explore the wonders of education, ExploreX provides the tools you need to succeed.",{"id":24,"path":25,"dir":14,"title":26,"description":27,"keywords":28,"body":30},"content:1.introduction:2.master-ui.md","/introduction/master-ui","Master User Interface","Master the user interface of ExloreX to ensure a smooth classroom experience.",[29,21],"Overview","  Master User Interface  Master the user interface of ExloreX to ensure a smooth classroom experience.  Overview  This page serves as a comprehensive guide, leading you through the intricacies of the user interface (UI) within ExploreX, guaranteeing a smooth and uninterrupted learning journey.  Getting Started  Upon launching ExploreX, you'll be greeted by a clean and intuitive interface. The dashboard is designed for easy navigation, with icons representing key features. You'll see the current time  The QuikNav  Just below the current time, you'll see what we call the \"QuikNav.\" The QuikNav, as the name suggests, is a Quick way of Navigating across ExploreX. Here, you'll see ExploreX's key features such as the 3D Model Library, the Browser, and the Dashboard.  The Searchbar  Next up, the searchbar. The searchbar helps you look for anything, from in-app settings to web searches, you'll be able to look for absolutely anything! Couldn't quite find what you were looking for? Use our exclusive AI instead, all built in!  Conclusion  We've made sure to keep the User Interface of ExploreX as simple and clean as possible, ensuring a smooth classroom experience!",{"id":32,"path":33,"dir":14,"title":34,"description":35,"keywords":36,"body":38},"content:1.introduction:3.writing-pages.md","/introduction/writing-pages","Writing Pages","Docus is made to let you write all your content in Markdown and Vue components with the MDC syntax.",[37],"Frontmatter","  Writing Pages  Docus is made to let you write all your content in Markdown and Vue components with the MDC syntax.  Each Markdown pages in the   content/  folder will be mapped to a route.     File  Generated route     index.md   /    about.md   /about    blog/index.md   /blog    blog/hello.md   /blog/hello    1.guide/2.installation   /guide/installation  Frontmatter  Docus supports multiple Front-matter attributes for pages.     ---   title  :   \"Get Started\"   description  :   \"Let's learn how to use my amazing module.\"   ---      Key   Type   Default   Description     layout   string   default  Use any layout name like you would in   definePageMeta()    title   string   Defines the page title and H1 in docs pages    description   string   Defines the page description and excerpt in docs pages    redirect   string   A route path to redirect    image   object   OpenGraph cover image    Docs layout options       aside   boolean   Toggles the visibility of aside navigation    toc   boolean   Toggles the visibility of table of contents    header   boolean   Toggles the visibility of the page header    bottom   boolean   Toggles the visibility of page bottom section    Navigation options       navigation   boolean   Toggles the visibility of the page or directory in navigation    navigation.title   string   Changes the name of the page or directory in navigation    navigation.icon   string   Changes the icon of the page or directory in navigation  html.dark .shiki span {color: var(--shiki-dark) !important;background: var(--shiki-dark-bg) !important;font-style: var(--shiki-dark-font-style) !important;font-weight: var(--shiki-dark-font-weight) !important;text-decoration: var(--shiki-dark-text-decoration) !important;}",{"id":40,"path":41,"dir":14,"title":42,"description":43,"keywords":44,"body":46},"content:1.introduction:4.configuration.md","/introduction/configuration","Configuration","Learn how to configure Docus.",[45],"Customizing the logo","  Configuration  Learn how to configure Docus.      export   default   defineAppConfig  ({     docus: {       title:   'Docus'  ,       description:   'My Docus Project'  ,       url:   'http://docus.dev'     }   })     export   default   defineAppConfig  ({     docus: {       title:   'Docus'  ,       description:   'My Docus Project'  ,       url:   'http://docus.dev'  ,       image:   '/social-card-preview.png'  ,       socials: {         twitter:   '@nuxt_js'  ,         github:   'nuxt-themes/docus'  ,       },       github: {         root:   'content'  ,         edit:   true  ,         contributors:   false       },       layout:   'default'  ,       aside: {         level:   1  ,         filter: [],       },       header: {         title:   false  ,         logo:   true  ,         showLinkIcon:   false       },       footer: {         credits: {           icon:   'IconDocus'  ,           text:   'Powered by Docus'  ,           href:   'https://docus.dev'  ,         },         textLinks: [           {             text:   'Nuxt'  ,             href:   'https://nuxt.com'  ,             target:   '_blank'  ,             rel:   'noopener'           }         ],         iconLinks: [           {             label:   'NuxtJS'  ,             href:   'https://nuxtjs.org'  ,             component:   'IconNuxtLabs'  ,           },           {             label:   'Vue Telescope'  ,             href:   'https://vuetelescope.com'  ,             component:   'IconVueTelescope'  ,           },         ],       }     }   })      Key   Type   Default   Description     title   string  Docus  Website title    titleTemplate   string  Docus  Website title template    description   string  My Docus Project  Website description    url   string   Website URL    layout   string  default  Fallback layout to use (supports   default  or   page )    Socials       socials   object   {}  Social links    socials.github   string   The repository to use on GitHub links    socials.twitter   string   The account to use on Twitter links    socials.youtube   string   The channel to use on Youtube links    socials.instagram   string   The account to use on Instagram links    socials.facebook   string   The account to use on Facebook links    socials.medium   string   The account to use on Medium links    socials.[social]   object   Override social or display custom one    socials.[social].label   string   A label to use for the social    socials.[social].icon   string   A icon to use for the social    socials.[social].href   string   A link to use for the social    socials.[social].rel   string   noopener noreferrer  A space-separated list of   link types    Header       header   object   Header configuration    header.logo   boolean   Whether or not to use   Logo.vue  as the header logo    header.title   string   If set to a string, will be used in the header    header.showLinkIcon   boolean   If set to   true  links icons will show in the header    header.exclude   string[]   An array of path to exclude out from the header navigation    header.fluid   boolean   true  Make header   Container  fluid    Main       main   object   Main configuration    main.fluid   boolean   true  Make main content   Container  fluid    main.padded   boolean   true  Make main content   Container  padded    Aside       aside   object   Aside configuration    aside.level   string  0  Aside base level of nesting    aside.collapsed   boolean   Will be used as default value for collapsible navigation categories    aside.exclude   string[]   An array of path to exclude out from the aside navigation    Footer       footer   object   Footer configuration    footer.credits   object   An object defining the bottom left credits    footer.credits.icon   object   The icon to use for the credits    footer.credits.text   object   The text to use for the credits    footer.textLinks   array   []  An array of texts to display at the center of footer    footer.textLinks[0].text   string   The text to display    footer.textLinks[0].href   string   A link to use for the text    footer.textLinks[0].target   string   _self  Where to display the linked URL, as the name for a browsing context    footer.textLinks[0].rel   string   noopener noreferrer  A space-separated list of   link types    footer.iconLinks   array   []  An array of icons to display in the footer    footer.iconLinks[0].label   string   A label to use for the icon    footer.iconLinks[0].href   string   A link to use for the icon    footer.iconLinks[0].icon   string   The icon to use (can be a component name)    footer.iconLinks[0].rel   string   noopener noreferrer  A space-separated list of   link types    footer.fluid   boolean   true  Make footer   Container  fluid    GitHub       github   object   false  GitHub integration configuration    github.dir   string   Directory containing the files to be edited    github.branch   string   Branch to start editing    github.repo   string   Name of the GitHub repo to edit files    github.owner   string   Owner of the repo    github.edit   boolean   Toggle \"Edit this page on Github\" component on documentation pages    Search       fuse   object   useFuse   options  Customizing the logo  To update the logo in the header, create a component in   components/Logo.vue  with your own logo.  In this example, the image is located at   /public/img .     \u003C  template  >     \u003C  img   width  =  \"120\"   src  =  \"/img/YOURLOGO.png\"  />   \u003C/  template  >  html.dark .shiki span {color: var(--shiki-dark) !important;background: var(--shiki-dark-bg) !important;font-style: var(--shiki-dark-font-style) !important;font-weight: var(--shiki-dark-font-weight) !important;text-decoration: var(--shiki-dark-text-decoration) !important;}",{"id":48,"path":49,"dir":50,"title":51,"description":7,"keywords":52,"body":53},"content:2.explorex-educators:introduction.md","/explorex-educators/introduction","explorex-educators","Introduction",[51],"  Introduction",1703842705394]